app/controllers/events_controller.rb

def create
	@event = Event.new(event_params)
  if @event.save
---
INSERT INTO "events" ("definition", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["definition", "toplantı"], ["date", "2018-07-15"], ["created_at", "2018-07-10 10:03:02.233071"], ["updated_at", "2018-07-10 10:03:02.233071"]]

def update
  @event = Event.find(params[:id])

  if @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "definition" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["definition", "1adasfknkhb"], ["updated_at", "2018-07-10 10:35:31.686748"], ["id", 1]]